//配置表格的标题
var th = ['姓名', '语文', '数学', '英语', '总分'];

//配置表格的单元格数据，为二重数组
var td = [
			['小明', '820', '97', '744', '2487'],
			['小红', '904', '625', '978', '2414'],
			['小亮', '632', '114', '72024', '234'],
			['小蛤', '110', '150', '301', '101'],
			['小哈', '11', '1450', '31', '1'],
			['小明', '820', '97', '744', '2487'],
			['小红', '904', '625', '978', '2414'],
			['小亮', '632', '114', '72024', '234'],
			['小蛤', '110', '150', '301', '101'],
			['小哈', '11', '1450', '31', '1'],
			['小明', '820', '97', '744', '2487'],
			['小红', '904', '625', '978', '2414'],
			['小亮', '632', '114', '72024', '234'],
			['小蛤', '110', '150', '301', '101'],
			['小哈', '11', '1450', '31', '1'],
			['小明', '820', '97', '744', '2487'],
			['小红', '904', '625', '978', '2414'],
			['小亮', '632', '114', '72024', '234'],
			['小蛤', '110', '150', '301', '101'],
			['小哈', '11', '1450', '31', '1']
		];

//需要排序序列的标题名
var sortCol = ['语文', '数学', '英语', '总分'];

//排序的方式，可自定义，若无自定义，则使用默认方法。
//若参数为default，则使用默认排序函数，否则使用自定义排序函数
var sortFunc = 'default';

//在页面中留下的表格结构hook
var tableSort =  document.getElementById('table-sort');

//设置为true，则首行冻结，否则首行不冻结。
var isFixed = true;

var table = new createTable(th, td, sortCol, sortFunc, tableSort, isFixed);

